Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum
The spring constant unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KG_M
Kilogram per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KG_CM
Kilogram per centimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KG_MM
Kilogram per millimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.TON_M
Ton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.TON_CM
Ton per centimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.TON_MM
Ton per millimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.N_M
Newton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.N_CM
Newton per centimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.N_MM
Newton per millimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.DAN_M
daNewton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.DAN_CM
daNewton per centimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.DAN_MM
daNewton per millimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KN_M
kNewton per meter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KN_CM
kNewton per centimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KN_MM
kNewton per millimeter.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.LBF_IN
lbf per inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.LBF_FT
lbf per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KIP_IN
kip per inch.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.KIP_FT
kip per feet.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitEnum.UNKNOWN
unknown unit.